src/cf/src/Documents/КадровыйПриказ/КадровыйПриказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровыйПриказ</name>
  <registerRecords>InformationRegister.ТарифныеСтавки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПриказа</name>
    <type>
      <types>EnumRef.ВидыКадровыхПриказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОклада</name>
      <type>
        <types>EnumRef.ВариантыОклада</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ТарифныеСтавки/ТарифныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифныеСтавки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидПриказа</name>
    <type>
      <types>EnumRef.ВидыКадровыхПриказов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОклада</name>
    <type>
      <types>EnumRef.ВариантыОклада</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/КадровыйПриказ/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьПредыдущиеДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПредыдущимиДанными();
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьПредыдущимиДанными();
КонецПроцедуры

#КонецОбласти
 
#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПолучитьПредыдущиеДанные();
	ЗаполнитьПредыдущимиДанными();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриказаПриИзменении(Элемент)
	ПолучитьПредыдущиеДанные(); 
	ЗаполнитьПредыдущимиДанными();
	УстановитьВидимостьРеквизитов(); 
КонецПроцедуры

&НаКлиенте
Процедура ТЧСотрудникиСотрудникПриИзменении(Элемент)
	ЗаполнитьПредыдущимиДанными();
КонецПроцедуры

#КонецОбласти
 
#Область Дополнительно

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
 	ЭтоПриём = Объект.ВидПриказа = ПредопределенноеЗначение("Перечисление.ВидыКадровыхПриказов.Приём");
	ЭтоПеревод = Объект.ВидПриказа = ПредопределенноеЗначение("Перечисление.ВидыКадровыхПриказов.Перевод");
	//
	Элементы.ТЧСотрудникиДолжность.Видимость = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиОклад.Видимость = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиГрафикРаботы.Видимость = ЭтоПриём Или ЭтоПеревод;
    Элементы.ТЧСотрудникиВариантОклада.Видимость = ЭтоПриём Или ЭтоПеревод;
    Элементы.ТЧСотрудникиМестоХранения.Видимость = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиДолжность.АвтоОтметкаНезаполненного = ЭтоПриём Или ЭтоПеревод; 
	Элементы.ТЧСотрудникиГрафикРаботы.АвтоОтметкаНезаполненного = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиВариантОклада.АвтоОтметкаНезаполненного = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиМестоХранения.АвтоОтметкаНезаполненного = ЭтоПриём Или ЭтоПеревод;
	//
	Элементы.ТЧСотрудникиГруппаЗаголовокСтроки.Видимость = ЭтоПеревод;
	Элементы.ТЧСотрудникиДолжностьИз.Видимость = ЭтоПеревод;
	Элементы.ТЧСотрудникиОкладИз.Видимость = ЭтоПеревод;
	Элементы.ТЧСотрудникиГрафикРаботыИз.Видимость = ЭтоПеревод;
    Элементы.ТЧСотрудникиВариантОкладаИз.Видимость = ЭтоПеревод;
    Элементы.ТЧСотрудникиМестоХраненияИз.Видимость = ЭтоПеревод;
КонецПроцедуры

&НаСервере
Процедура ПолучитьПредыдущиеДанные()
	Если Объект.ВидПриказа <> Перечисления.ВидыКадровыхПриказов.Перевод Тогда Возврат КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТарифныеСтавкиСрезПоследних.Сотрудник КАК Сотрудник,
	                      |	ТарифныеСтавкиСрезПоследних.Должность КАК Должность,
	                      |	ТарифныеСтавкиСрезПоследних.Оклад КАК Оклад,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	                      |	ТарифныеСтавкиСрезПоследних.ВариантОклада КАК ВариантОклада,
	                      |	ТарифныеСтавкиСрезПоследних.МестоХранения КАК МестоХранения
	                      |ИЗ
	                      |	РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаСреза, ) КАК ТарифныеСтавкиСрезПоследних");
	Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(Объект.Дата) - 1);
	ТЗПредыдущиеДанные.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредыдущимиДанными()
	Для Каждого Стр Из Объект.ТЧСотрудники Цикл
		Мас = ТЗПредыдущиеДанные.НайтиСтроки(Новый Структура("Сотрудник", Стр.Сотрудник));	
		Если Мас.Количество() = 0 Тогда 
			Стр.ДолжностьИз = Неопределено;
			Стр.ОкладИз = 0;
			Стр.ГрафикРаботыИз = Неопределено;
			Стр.ВариантОкладаИз = Неопределено;	
			Стр.МестоХраненияИз = Неопределено;	
		Иначе	
			Стр.ДолжностьИз = Мас[0].Должность;
			Стр.ОкладИз = Мас[0].Оклад;
			Стр.ГрафикРаботыИз = Мас[0].ГрафикРаботы;
			Стр.ВариантОкладаИз = Мас[0].ВариантОклада;
			Стр.МестоХраненияИз = Мас[0].МестоХранения;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти
